In [2]:
import pandas as pd
import seaborn as sns

In [10]:
df = sns.load_dataset('titanic')
df.pivot_table(index='who', values=['survived', 'pclass'])

         pclass  survived
who
child  2.626506  0.590361
man    2.372439  0.163873
woman  2.084871  0.756458

In [14]:
df.pivot_table(columns='who', values='survived')

who          child       man     woman
survived  0.590361  0.163873  0.756458

In [ ]:
## 다중그룹 - 단일컬럼

In [16]:
df.pivot_table(index=['who', 'pclass'], values='survived')

              survived
who   pclass
child 1       0.833333
      2       1.000000
      3       0.431034
man   1       0.352941
      2       0.080808
      3       0.119122
woman 1       0.978022
      2       0.909091
      3       0.491228

In [ ]:
## index에 컬럼을 중첩하지 않고 행과 열로 펼치기

In [18]:
df.pivot_table(index='who', columns='pclass', values='survived')

pclass         1         2         3
who
child   0.833333  1.000000  0.431034
man     0.352941  0.080808  0.119122
woman   0.978022  0.909091  0.491228

In [ ]:
## 다중 통계함수 적용

In [22]:
df.pivot_table(index='who', columns='pclass', values='survived', aggfunc=['sum', 'mean'])

       sum              mean
pclass   1   2   3         1         2         3
who
child    5  19  25  0.833333  1.000000  0.431034
man     42   8  38  0.352941  0.080808  0.119122
woman   89  60  56  0.978022  0.909091  0.491228